---
kind: method
id: M:Autodesk.Revit.DB.Edge.GetFace(System.Int32)
source: html/08b763f1-ec6d-1448-a04a-b0d7e6c095b4.htm
---
# Autodesk.Revit.DB.Edge.GetFace Method

Returns one of the two faces that meet at the edge.

## Syntax (C#)
```csharp
public Face GetFace(
	int index
)
```

## Parameters
- **index** (`System.Int32`) - The index of the face (0 or 1).